app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 13 ORDER BY "posts"."id" ASC LIMIT 1
---
	def show
		@post = Post.find(params[:id])

INSERT INTO "posts" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 11 Feb 2014 13:37:26 UTC +00:00], ["text", "Текст"], ["title", "Заглавие"], ["updated_at", Tue, 11 Feb 2014 13:37:26 UTC +00:00]]
---
	def create
  	 	@post = Post.new(post_params)

  		if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "17"]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = 17  [["text", "tecdcf"], ["updated_at", Tue, 11 Feb 2014 15:32:46 UTC +00:00]]
---
  	 def update
  		@post = Post.find(params[:id])
  		if @post.update(post_params)